# Taps
tap 'homebrew/bundle'
# enable installings apps over cli
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap "getantibody/tap"


# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'bat'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git-flow-avh'
brew 'git'
brew 'htop'
brew 'httpie'
brew 'antibody'

# additional git features
brew 'hub'

# backup all application settings
brew 'mackup'

# use app store from the cli
brew 'mas'
brew 'ncdu'
brew 'prettyping'
brew 'tldr'
brew 'tmux'

# move items to the trash
brew 'trash'
# tree command from windows
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'wifi-password'
brew 'nvm'
brew 'yarn'

# Development
brew 'php'
brew 'mysql@5.7'
brew 'imagemagick'

# Development Apps

# terminal app
cask 'iterm2'
cask 'postman'

#sql client
cask 'sequel-pro'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Apps

# password manager
cask '1password'

# screen saver
cask 'aerial'
cask 'alfred'

# toggle sleep timer
cask 'caffeine'
cask 'firefox'
cask 'google-chrome'

cask 'imageoptim'

#emoji client
cask 'rocket'
cask 'slack'

#window manager for mac
# cask 'spectacle'
cask 'moom'
cask 'spotify'
cask 'franz'
cask 'vlc'

# Quicklook - hitting space in finder
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
